# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    # input [batch, 3, 6, width, height]
    [-1, 1, Conv_3D, [64, 6, 2, 1, 1, 0, 2]],         # 0-P1/2  -> Params -> ch_out, k, s, tk, ts, tp, p 
    [-1, 1, Conv_3D, [128, 3, 2, 3, 1, 1, 1]],        # 1-P2/4  -> Params -> ch_out, k, s, tk, ts, tp, p
    [-1, 3, C3_3D, [128]],                            # 2       -> Params -> ch_out, n, btk, btp
    #C1_F
    [-1, 1, Conv_3D, [256, 3, 2, 3, 1, 1, 1]],        # 3-P3/8  -> Params -> ch_out, k, s, tk, ts, tp, p 
    [-1, 6, C3_3D, [256]],                            # 4       
    [-1, 1, TemporalAvgPool3d, []],                   # 5       -> second concat
    #C2_F
    [-2, 1, Conv_3D, [512, 3, 2, 3, 1, 1, 1]],        # 6-P4/16 
    [-1, 9, C3_3D, [512]],                            # 7       
    [-1, 1, TemporalAvgPool3d, []],                   # 8       -> first concat 
    #C3_F                   
    [-2, 1, Conv_3D, [1024, 3, 2, 3, 1, 1, 1]],       # 9-P5/32
    [-1, 3, C3_3D, [1024]],                           # 10
    [-1, 1, TemporalAvgPool3d, []],                   # 11       
    #C4_F
    [-1, 1, SPPF, [1024, 5]],                         # 12      
  ]

# YOLOv5 v6.0 head
head:
  [
    [-1, 1, Conv, [512, 1, 1]],                       # 13    -> fourth concat
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],       # 14
    [[-1, 8], 1, Concat, [1]],                        # 15    -> cat backbone P4
    [-1, 3, C3, [512, False]],                        # 16    -> third concat

    [-1, 1, Conv, [256, 1, 1]],                       # 17
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],       # 18
    [[-1, 5], 1, Concat, [1]],                        # 19    -> cat backbone P3
    [-1, 3, C3, [256, False]],                        # 20    -> (P3/8-small)      // Detect

    [-1, 1, Conv, [256, 3, 2]],                       # 21
    [[-1, 17], 1, Concat, [1]],                       # 22    -> cat head P4
    [-1, 3, C3, [512, False]],                        # 23    -> (P4/16-medium)    // Detect

    [-1, 1, Conv, [512, 3, 2]],                       # 24
    [[-1, 13], 1, Concat, [1]],                       # 25    -> cat head P5
    [-1, 3, C3, [1024, False]],                       # 26    -> (P5/32-large)     // Detect

    [[20, 23, 26], 1, Detect, [nc, anchors]],         # Detect(P3, P4, P5)
  ]