# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    # input [batch, 3, 6, width, height]
    [-1, 1, Conv_3D, [64, 6, 2, 1, 1, 2]],            # 0-P1/2 -> Params -> ch_out, k, s, tk, ts, p 
    [-1, 1, Conv_3D, [128, 3, 2, 1, 1, 1]],           # 1-P2/4 -> Params -> ch_out, k, s, tk, ts, p
    [-1, 3, C3_3D, [128]],                            # 2
    # first setup
    [-1, 1, Conv_3D, [256, 3, 2, 1, 1, 1]],           # 3-P3/8 -> second concat  -> Params -> ch_out, k, s, tk, ts, p 
    [-1, 1, TemporalAvgPool3d, []],                   # 4 -> TempAvgPool for concat #2
    [-2, 6, C3_3D, [256]],                            # 5 
    # second setup
    [-1, 1, Conv_3D, [512, 3, 2, 1, 1, 1]],           # 6-P4/16 -> first concat
    [-1, 1, TemporalAvgPool3d, []],                   # 7 -> TempAvgPool for concat #1
    [-2, 9, C3_3D, [512]],                            # 8                       
    [-1, 1, Conv_3D, [1024, 3, 2, 1, 1, 1]],          # 9-P5/32
    [-1, 3, C3_3D, [1024, 2]],                        # 10
    # third setup
    [-1, 1, SPPF, [1024, 5]],                         # 11 -> fourth concat
  ]

# YOLOv5 v6.0 head
head:
  [
    [-1, 1, Conv, [512, 1, 1]],                       # 12
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],       # 13
    [[-1, 7], 1, Concat, [1]],                        # 14 -> cat backbone P4
    [-1, 3, C3, [512, False]],                        # 15 -> third concat

    [-1, 1, Conv, [256, 1, 1]],                       # 16
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],       # 17
    [[-1, 4], 1, Concat, [1]],                        # 18 -> cat backbone P3
    [-1, 3, C3, [256, False]],                        # 19 -> (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],                       # 20
    [[-1, 16], 1, Concat, [1]],                       # 21 -> cat head P4
    [-1, 3, C3, [512, False]],                        # 22 -> (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],                       # 23
    [[-1, 12], 1, Concat, [1]],                       # 24 -> cat head P5
    [-1, 3, C3, [1024, False]],                       # 25 -> (P5/32-large)

    [[19, 22, 25], 1, Detect, [nc, anchors]],         # Detect(P3, P4, P5)
  ]
