# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
clip_size: 3 #lenght of the input clip
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    # input [batch, 3, 6, width, height]
    [-1, 1, Conv_3D, [64, 6, 2, 1, 1, 0, 2]],         # 0-P1/2  -> Params -> ch_out, k, s, tk, ts, tp, p 
    [-1, 1, Conv_3D, [128, 3, 2, 3, 1, 1, 1]],        # 1-P2/4  -> Params -> ch_out, k, s, tk, ts, tp, p
    [-1, 3, C3_3D, [128]],                            # 2       -> Params -> ch_out, n, btk, btp
    #C1_F
    [-1, 1, Conv_3D, [256, 3, 2, 3, 1, 1, 1]],        # 3-P3/8  -> Params -> ch_out, k, s, tk, ts, tp, p 
    [-1, 6, C3_3D, [256]],                            # 4       
    [-1, 1, TemporalAvgPool3d, []],                   # 5       -> second concat
    #C2_F
    [-1, 1, Conv, [512, 3, 2]],                       # 6-P4/16 
    [-1, 9, C3, [512]],                               # 7       -> first concat 
    #C3_F                   
    [-1, 1, Conv, [1024, 3, 2]],                      # 8-P5/32
    [-1, 3, C3, [1024]],                              # 9
    #C4_F
    [-1, 1, SPPF, [1024, 5]],                         # 10      
  ]

# YOLOv5 v6.0 head
head:
  [
    [-1, 1, Conv, [512, 1, 1]],                       # 11    -> fourth concat
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],       # 12
    [[-1, 7], 1, Concat, [1]],                        # 13    -> cat backbone P4
    [-1, 3, C3, [512, False]],                        # 14    -> third concat

    [-1, 1, Conv, [256, 1, 1]],                       # 15
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],       # 16
    [[-1, 5], 1, Concat, [1]],                        # 17    -> cat backbone P3
    [-1, 3, C3, [256, False]],                        # 18    -> (P3/8-small)      // Detect

    [-1, 1, Conv, [256, 3, 2]],                       # 19
    [[-1, 15], 1, Concat, [1]],                       # 20    -> cat head P4
    [-1, 3, C3, [512, False]],                        # 21    -> (P4/16-medium)    // Detect

    [-1, 1, Conv, [512, 3, 2]],                       # 22
    [[-1, 11], 1, Concat, [1]],                       # 23    -> cat head P5
    [-1, 3, C3, [1024, False]],                       # 24    -> (P5/32-large)     // Detect

    [[18, 21, 24], 1, Detect, [nc, anchors]],         # Detect(P3, P4, P5)
  ]